function [UpAroon,DownAroon] =AROON(High,Low,Length)
%--------------------此函数用来计算AROON指数(阿隆指标)---------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]光大证券.技术指标系列(三)——加入“二次确认”的AROON阿隆优化指标，2012-05-09
%[2]MBA智库百科.阿隆指标词条
%[3]交易开拓者.AROON指标算法
%----------------------------------简介----------------------------------
%阿隆指标(Aroon)是由图莎尔·钱德(Tushar Chande)1995年发明的，它通过
%计算自价格达到近期最高值和最低值以来所经过的期间数，帮助投资者预测证
%券价格从趋势到区域、区域或反转的变化。AROON指标分为两个具体指标，分
%别为AROONUP及AROONDOWN。其具体的计算方式为: 
%第一步：AROON_UP=[(计算期天数-最高价后的天数)/计算期天数]*100 
%第二步：AROON_DN=[(计算期天数-最低价后的天数)/计算期天数]*100 
%第三步：AROON=AROON_UP-AROON_DN 
%常用参数为20 
%----------------------------------基本用法------------------------------
%当AROON_UP指标向下跌破50时，表示向上的趋势正在失去动力
%当AROON_DN指标向下跌破50时，表示向下的趋势正在失去动力
%如果两个指标都在低位，表示股价没有明确的趋势。如果指标在70以上，表示
%趋势十分强烈；如果在30以下，表明相反的趋势正在酝酿 
%若计算期为20，那么AROON_UP=50，意味着最高价出现在第10天；AROON_DN=
%50，意味着最低价出现在第10天
%AROON_UP-AROON_DN>0,意味着最高价比最低价较晚出现，离现在近。
%AROON_UP-AROON_DN>x，意味着最高价离现在比最低价离现在多20x/100天,
%即若x=40，20x/100=8天，表明现在还处于强势中，反之亦然。
%详细用法，请查看参考
%----------------------------------调用函数------------------------------
%[UpAroon,DownAroon] =AROON(High,Low,Length)
%----------------------------------参数----------------------------------
%High-最高价序列
%Low-最低价序列
%Length，计算时所考虑的时间周期，常用20个Bar
%----------------------------------输出----------------------------------
%UpAroon-向上阿隆指标
%DownAroon-向下阿隆指标

UpAroon=zeros(length(High),1);
DownAroon=zeros(length(High),1);
UpAroon(1:Length)=50;
DownAroon(1:Length)=50;
for i=Length+1:length(High)
    [Highest,UpBar]=max(High(i-Length:i));
    UpAroon(i)=(Length-(Length-UpBar+1))/Length*100;
    [Lowest,DownBar]=min(Low(i-Length:i));
    DownAroon(i)=(Length-(Length-DownBar+1))/Length*100;
end

end