function CMOValue=CMO(Price,Length)
%--------------------此函数用来计算CMO指数(动量波动指标)-------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]光大证券.技术指标系列(七)--CMO动量波动指标的运用，2012-08-14?
%[2]MBA智库百科.CMO词条
%[3]交易开拓者.CMO指标算法
%----------------------------------简介----------------------------------
%钱德动量摆动指标(Chande Momentum Osciliator,动量波动指标，纯动力振荡指标)
%是由钱德发明的，与其它动量指标摆动指标如RSI和KDJ不同，CMO在计算公式的分子
%中采用上涨日和下跌日数据。
%----------------------------------基本用法------------------------------
%1)当CMO上穿0线，买入信号产生；当CMO下穿0线，卖出信号产生
%2)当CMO大于50时，处于超买状态；当CMO小于-50时处于超卖状态
%3)CMO的绝对值越高，趋势越强。较低的CMO绝对值(0附近)标示的证券在水平方向波动
%4)当CMO上穿/下穿移动平均线时，将是买/卖信号
%5)可以利用CMO衡量趋势强度的能力来改进趋势跟踪机制。例如当CMO的绝对值较高时仅
%  根据趋势跟踪指标来操作；当CMO的绝对值较低时转而采用交易范围指标
%----------------------------------调用函数------------------------------
%CMOValue=CMO(Price,Length)
%----------------------------------参数----------------------------------
%Price-价格序列，可用Open、High、Low或Close，常用Close
%Length-计算时所考虑的时间周期，常用14或20个Bar
%----------------------------------输出----------------------------------
%CMOValue-动量波动指标

CMOValue=zeros(length(Price),1);
DiffofPrice=zeros(length(Price),1);
DiffofPrice(2:end)=Price(2:end)-Price(1:end-1); 
for i=Length+1:length(Price)
    Temp=DiffofPrice(i-Length+1:i);
    CMOValue(i)=(sum(Temp(Temp>0))-sum(abs(Temp(Temp<0))))/sum(abs(Temp))*100;
end
end

