function CVValue=CV(High,Low,Length)
%--------------------此函数用来计算CV指标(佳庆离散指标)--------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%MBA智库百科.CV指标词条
%交易开拓者(TB).公式应用CV指标算法
%----------------------------------简介----------------------------------
%佳庆离散指标(Chaikin Volatility，简称CVLT，VCI，CV）又称“佳庆变异率指
%数”，是通过测量一段时间内价格幅度平均值的变化来反映价格的离散程度。佳庆离
%散指标由马可?蔡金(Marc Chaikin)提出，它的计算方法和离散比率(VLT)很相似，
%但佳庆离散指标中没有考虑跳空缺口的作用。Chaikin Volatility指针同时配合移
%动平均线(简单移动平均线、EMA、WMA)和Envelopes使用会效果更佳。
%----------------------------------基本用法------------------------------
%1)当价格上涨形态被破坏，并进入区间盘整状态,此时CV曲线处于顶部(高水平位置)
%2)区间盘整或区间被突破时, CV曲线通常处于底部(低水平位置)
%3)价格上涨时Chaikin Volatility指标的数值将随之上升
%4)当价格将要到达顶部时，会出现突然加速上升的现象
%5)当市场渐渐无力时,反转行情的可能性增高,会出现急速下降的现象
%----------------------------------调用函数------------------------------
%CVValue=CV(High,Low,Length)
%----------------------------------参数----------------------------------
%High-最高价序列
%Low-最低价序列
%Length-考虑的时间周期，常用10个BAR
%----------------------------------输出----------------------------------
%CVValue-佳庆离散指标

CVValue=zeros(length(High),1);
HiLoMA=EMA(High-Low,Length);
TempValue=zeros(length(High),1);
TempValue(Length+1:end)=HiLoMA(1:end-Length);
CVValue=(HiLoMA-TempValue)./TempValue*100;
CVValue(CVValue==inf)=0;
end

