function [DMAValue,AMAValue]=DMA(Price,FastLength,SlowLength,SmoothLength)
%----------------------此函数用来计算DMA指标(离差移动平均)---------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]招商证券.基于纯技术指标的多因子选股模型,2014-04-11
%[2]姜金胜.指标精萃：经典技术指标精解与妙用.东华大学出版社,2004年01月第1版
%----------------------------------简介----------------------------------
%DMA指标又叫平行线差指标(离差移动平均)，该指标依据快慢两条移动平均线的差值情况
%来分析价格趋势。它主要通过计算两条不同周期的移动平均线的差值，来判断当前买入
%卖出能量的大小和未来价格走势的趋势。该函数的和MACD极其相似，MACD用的是指数
%移动平均，而该函数用的是简单移动平均
%----------------------------------基本用法------------------------------
%1)当DMA和AMA均大于0并向上移动时，表示处于多头行情，可以买入；当DMA和AMA均小于
%0并向下移动时，表示处于空头行情中，可以卖出
%2)DMA和AMA形成金叉买入，死叉卖出
%----------------------------------调用函数------------------------------
%[DMAValue,AMAValue]=DMA(Price,FastLength,SlowLength,SmoothLength)
%----------------------------------参数----------------------------------
%Price-目标价格序列
%FastLength-计算DMAValue时的短周期，常用10
%SlowLength-计算DMAValue时的长周期，常用50
%SmoothLength-计算AMAValue时的周期，常用10
%----------------------------------输出----------------------------------
%DMAValue-短期均线和长期均线之差
%AMAValue-DMAValue的移动平均

DMAValue=zeros(length(Price),1);
AMAValue=zeros(length(Price),1);
DMAValue=MA(Price,FastLength)-MA(Price,SlowLength);
AMAValue=MA(DMAValue,SmoothLength);
end

