function DPOValue=DPO(Price,Length)
%--------------------此函数用来计算DPO指标(区间振荡指标)-------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]百度百科.DPO词条
%[2]MBA智库百科.DPO词条
%[3]交易开拓者(TB).DPO指标算法
%[4]同花顺.DPO指标算法
%----------------------------------简介----------------------------------
%区间震荡线(Detrended price Oscillator，DPO)，是由惠特曼.巴塞特(Walt 
%Bressert)提出的。是一个排除价格趋势的震荡指标。它试图通过扣除前期移动平
%均价来消除长期趋势对价格波动的干扰，从而便于发现价格短期的波动和超买超卖
%水平。宇宙间的事物，是一种生生不息的循环。有些循环可以预测，例如：四季的
%循环、动物的冬眠等等。然而宇宙间，仍存在着人类无法准确预测的循环。例如：
%天气、地震。这是因为很多周期长短不同的循环，错综干扰的交互作用，使得个别
%周期无法单独显现。惠特曼?巴塞特研究这种交互作用后发现，一个长周波包含了数
%个短周波。数个短周波的组合，构成一个长周波。观察短周波的运动规律，可以估
%计长周波峰谷出现的时机。例如：四个短期循环底部，构成一个长期循环底部。因
%此，DPO指标刻意忽略较长周期的波动，一方面可以减少周期干扰的混淆，一方面可
%以凸显个别周期的波动。
%----------------------------------基本用法------------------------------
%1)DPO>0，表明目前处于多头市场；DPO<0，表明目前处于空头市场
%2)在0轴上方，设定一条超买线，当DPO波动至超买线时，价格会形成短期高点
%3)在0轴下方，设定一条超卖线，当DPO波动至超卖线时，价格会形成短期低点
%4)超买超卖的范围随个股的不同而不同，使用者应自行设定。
%更多用法，请查看参考
%----------------------------------调用函数------------------------------
%DPOValue=DPO(Price,Length)
%----------------------------------参数----------------------------------
%Price-价格序列，常用收盘价序列
%Length-
%----------------------------------输出----------------------------------
%DPOValue-区间振荡指标

DPOValue=zeros(length(Price),1);
Offset=floor(Length*0.5+1);
MAValue=MA(Price,Length);
DPOValue(Offset+1:end)=Price(Offset+1:end)-MAValue(1:end-Offset);
end

