function [UpperLine MiddleLine LowerLine]=ENV(Price,Length,Width,Type)
%----------------------此函数用来计算ENV指标(包络线)-----------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]MBA智库百科.包络线词条
%[2]交易开拓者.公式应用ENV指标算法
%----------------------------------简介----------------------------------
%包络线(Envelopes)技术指标是由两条移动平均线组成，一个向上运动，另外一个向
%下运动。选择哪个相关联数量的通道边幅的移动是由市场的变化率决定的：市场变化
%率越高，通道边幅的变化就越强烈。包络线被用来预测市场价格在平均价格上下波动
%的范围，中轴为一条移动均线，将当前均线值加上或减去一个固定的百分比数额则可
%得到包络线的上下轨。包络线指标背后的逻辑就是过于热情的买家和卖家推动价格达
%到极端(上端通道或者是下端通道)在这几点上，价格通过移动到一个相对现实的水平
%上而通常变得比较稳定
%----------------------------------基本用法------------------------------
%包络线指数定义价格范围的上下边幅。当价格到达通道上端的边幅时，卖出信号就出
%现了；当价格达到通道下端的边幅时，则购买信号出现了。(仅供参考)
%----------------------------------调用函数------------------------------
%[UpperLine MiddleLine LowerLine]=ENV(Price,Length,Width,Type)
%----------------------------------参数----------------------------------
%Price-价格序列，常用收盘价
%Length-计算移动平均的周期数，常用14个Bar
%Width-包络线的宽度
%Type-移动平均的类型，0表示简单平均，1表示指数平均，默认为0
%----------------------------------输出----------------------------------
%UpperLine-包络线上轨
%MiddleLine-包络线中轨
%LowerLine-包络线下轨

if nargin<4
    Type=0;
end
UpperLine=zeros(length(Price),1);
MiddleLine=zeros(length(Price),1);
LowerLine=zeros(length(Price),1);
if Type==0
    MiddleLine=MA(Price,Length);
elseif Type==1
    MiddleLine=EMA(Price,Length);
end
UpperLine=MiddleLine*(1+Width);
LowerLine=MiddleLine*(1-Width);
end

