function ForceIndexValue=ForceIndex(Price,Volume)
%--------------------此函数用来计算ForceIndex(劲道指数)-------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]Elder.以交易为生.机械工业出版社，2010年4月第1版
%----------------------------------简介----------------------------------
%劲道指数是由Elder发明的一种振荡指标，它衡量每一次上涨和下跌背后多空的劲道。
%劲道指数包含了三种基本的市场信息，即价格变化的方向、价格变动范围和成交量。
%我们可以直接使用劲道指数，但经过移动平均平滑后的劲道指数更有效。用劲道指数
%的短期移动平均有助于抓抓买卖点，用劲道指数的长期移动平均线能揭示多空双方
%劲道的重大变化。每轮走势的劲道都可根据其方向、幅度和成交量来确定。如果价格
%收高，劲道就为正了；如果价格收低，劲道就为负。价格变化的幅度越大，劲道也就越
%大；成交量越大，走势的劲道也就越大。
%----------------------------------基本用法------------------------------
%使用时建议使用劲道指数的移动平均(用MA函数或则EMA函数)
%具体用法请参考Elder的《以交易为生》
%----------------------------------调用函数------------------------------
%ForceIndexValue=ForceIndex(Price,Volume)
%----------------------------------参数----------------------------------
%Price-价格序列，常用收盘价
%Volume-成交量序列
%----------------------------------输出----------------------------------
%ForceIndexValue-劲道指数

ForceIndexValue=zeros(length(Price),1);
ForceIndexValue(1)=0;
ForceIndexValue(2:end)=Volume(2:end).*(Price(2:end)-Price(1:end-1));
end

