function [KValue,DValue,JValue]=KDJ(High,Low,Close,N,M,L,S)
%----------------------此函数用来计算KDJ指标(随机指标)---------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]招商证券.基于纯技术指标的多因子选股模型,2014-04-11
%[2]光大证券.技术指标系列（一）——KDJ优化指标，6年累积收益17.5倍,2012-05-07
%[3]浙商证券.技术指标优化择时：10年30倍收益,2010-12-23
%[4]MBA智库百科.KDJ词条
%[5]姜金胜.指标精萃：经典技术指标精解与妙用.东华大学出版社,2004年01月第1版
%----------------------------------简介----------------------------------
%KDJ指标，由George Lane首创，最早用于期货市场。它的主要理论依据是：当价格上涨时
%，收市价倾向于接近当日价格区间的上端；相反，在下降趋势中收市价趋向于接近当日价
%格区间的下端。随机指标(KDJ)一般是根据统计学的原理，通过一个特定的周期内出现过
%的最高价、最低价及最后一个计算周期的收盘价及这三者之间的比例关系，来计算最后一个
%计算周期的未成熟随机值RSV，然后根据平滑移动平均线的方法来计算K值、D值与J值。
%----------------------------------基本用法------------------------------
%1)当KD超过80时是卖出信号，当KD低于20时买入信号
%2)当K上穿D时买入，当K下穿D时卖出
%3)J大于100超买，小于0超卖
%----------------------------------调用函数------------------------------
%[KValue,DValue,JValue]=KDJ(High,Low,Close,N,M,L,S)
%----------------------------------参数----------------------------------
%High-每个Bar的最高价序列
%Low-每个Bar的最低价序列
%Close-每个Bar的收盘价序列
%N-计算RSV时所考虑的周期（RSV是体现现在的价格处于过去n天的位置情况）,常用14
%M-计算K值时的参数,常用3
%L-计算D值时的参数,常用3
%S-计算J值时的参数,常用3
%----------------------------------输出----------------------------------
%KValue-K值
%DValue-D值
%JValue-J值
RSV=zeros(length(High),1);
KValue=zeros(length(High),1);
DValue=zeros(length(High),1);
JValue=zeros(length(High),1);
RSV(1:N-1)=50;
KValue(1:N-1)=50;
DValue(1:N-1)=50;
for i=N:length(High)
    RSV(i)=(Close(i)-min(Low(i-N+1:i)))/(max(High(i-N+1:i))-min(Low(i-N+1:i)))*100;
    KValue(i)=(M-1)/M*KValue(i-1)+1/M*RSV(i);
    DValue(i)=(L-1)/L*DValue(i-1)+1/L*KValue(i);
end
JValue=S*DValue-(S-1)*KValue;
end








