function MFIValue=MFI(High,Low,Close,Volume,Length)
%--------------------此函数用来计算MFI指数(资金流量指数)-------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]招商证券.基于纯技术指标的多因子选股模型,2014-04-11
%[2]浙商证券.技术指标优化择时：10年30倍收益,2010-12-23
%[3]MBA智库百科.MFI词条
%[4]同花顺.MFI指标算法
%[5]交易开拓者.MFI指标算法
%----------------------------------简介----------------------------------
%资金流量指标(Money Flow Index),根据成交量来计算市场供需关系和买卖力道，该
%指标是通过反映价格变动的四个元素：上涨的天数、下跌的天数、成交量增加幅度、
%成交量减少幅度来研判量能的趋势，预测市场供求关系和买卖力道，属于量能反趋势
%指标。1989年Wells Wilder首次发表了MFI的用法。MFI是将RSI加以修改后，演变而
%来。RSI以成交价为计算基础，MFI指标则结合价和量，将其列入综合考虑的范围。可以
%说，MFI指标是成交量的RSI指标。
%----------------------------------基本用法------------------------------
%1)当MFI大于80时，处于超买状态，是卖出信号
%  当MFI低于20时，处于超卖状态，是买入信号
%2)当MFI向上突破20时，短线买入；当MFI向下突破80时，短线卖出
%更多用法，请查看参考
%----------------------------------调用函数------------------------------
%MFIValue=MFI(High,Low,Close,Volume,Length)
%----------------------------------参数----------------------------------
%High-最高价序列
%Low-最低价序列
%Close-收盘价序列
%Volume-成交量
%Length-计算时所考虑的周期，常用14个Bar
%----------------------------------输出----------------------------------
%MFIValue-资金流量指数

MFIValue=zeros(length(High),1);
DiffofTP=zeros(length(High),1);
TP=(High+Low+Close)/3;
DiffofTP(2:end)=TP(2:end)-TP(1:end-1);
MF=TP.*Volume;
MFIValue(1:Length)=50;
for i=Length+1:length(High)
    Temp=MF(i-Length+1:i);
    PMF=Temp(DiffofTP(i-Length+1:i)>0);
    MFIValue(i)=sum(PMF)/sum(Temp)*100;%即典型价格上涨日的资金流量之和(Length个Bar)除以总的资金流量之和(Length个Bar)
end
end

