function MTMValue=MTM(Price,Length)
%----------------------此函数用来计算MTM指标(动量指标)---------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]招商证券.基于纯技术指标的多因子选股模型,2014-04-11
%[2]浙商证券.技术指标优化择时：10年30倍收益,2010-12-23
%[3]姜金胜.指标精萃：经典技术指标精解与妙用.东华大学出版社,2004年01月第1版
%----------------------------------简介----------------------------------
%MTM指标又叫动量指标，其英文全称是“Momentum”，是一种专门研究价格波动
%的中短期技术分析工具。动量指标 MTM 是一种利用动力学原理，专门研究价格
%在波动过程中各种加速、惯性作用以及由静到动或由动转静的现象。动量指标的
%理论基础是价格与供求量的关系。它认为价格的涨跌幅度随着时间的推移会逐渐
%变小，价格变化的速度和能量也会慢慢减缓后，行情就可能反转。在多头行情里，
%随着价格地不断上升，股价上涨的能量和速度必将日渐萎缩，当上涨的能量和速
%度减少到一定程度时，行情将会出现大幅回荡整理或见顶反转的行情；而在空头
%行情里，随着价格地不断下跌，价格下跌的能量和速度也将日渐萎缩，当下跌的
%能量和速度萎缩到一定程度时，行情也会出现大幅反弹或见底反转的行情。 因此，
%动量指标就是通过观察价格波动的速度，衡量价格波动的动能，从而揭示价格反转
%的规律，为投资者正确地买卖价格提供重要的参考。MTM 的计算方法很简单，用当
%日的收盘价减去N日前的收盘价即可。 
%----------------------------------基本用法------------------------------
%1)当MTM在0 轴之上时为多头市场，否则为空头市场
%2)MTM与其移动平均形成金叉则买入，形成死叉则卖出
%3)短期MTM移动均线和长期MTM移动均线形成金叉时买入，形成死叉时卖出
%具体用法查看参考
%----------------------------------调用函数------------------------------
%MTMValue=MTM(Price,Length)
%----------------------------------参数----------------------------------
%Price-价格序列，常用收盘价序列
%Length-计算动量指标所考虑的时间周期，常用12
%----------------------------------输出----------------------------------
%MTMValue-动量指标

MTMValue=zeros(length(Price),1);
MTMValue(Length+1:end)=Price(Length+1:end)-Price(1:end-Length);
end

