function NVIValue=NVI(Close,Volume)
%--------------------此函数用来计算NVI指标(负成交量指标)-------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]百度百科.NVI词条
%[2]MBA智库百科.NVI词条
%[3]交易开拓者.公式应用NVI指标算法
%----------------------------------简介----------------------------------
%负成交量指标(Negative Volume Index，NVI)又称为负量指标，是费班克(Norman 
%Forback)研发的成果。其作用与正量指标相类似，主要用途除了被利用于寻找买卖点
%之外，更是侦测大多头市场的主要分析工具。PVI指标的理论观点认为，当日的市况如
%果价跌量缩时，表示大户主导市场。也就是说，PVI指标主要的功能，在于侦测行情是
%否属于大户市场。由于散户扮演着行情追随者的角色，并且具有追涨杀跌的特证。因
%此，当行情出现价涨量增的走势时，散户的信心增加，介入市场的动机转为积极。此
%时，财力雄厚的“庄家”或者“大户”，正好趁行情活络的机会，顺势调节股票。相
%反的，散户因为资金相对不足的原故，无法在股中行情不好的时候，逢低向下分批承
%接。因此，当行情呈现价跌量缩的走势时，大部分散户会退场观望，此时，大户反而
%伺机吸纳股票。因此理论上，NVI指标将萎缩的成交量视为大户介入的资金。
%----------------------------------基本用法------------------------------
%1)NVI指标位于其N天移动平均线之上时，表示目前处于多头市场
%2)NVI指标由下往上穿越其N天移动平均线，代表长期买进讯号
%3)NVI指标位于其N天移动平均线之下时，表示目前处于空头市场
%4)NVI指标由上往下穿越其N天移动平均线时，代表长期卖出讯号
%5)NVI指标与PVI指标，分别向上穿越其N天移动平均线时，视为大多头讯号
%----------------------------------调用函数------------------------------
%NVIValue=NVI(Close,Volume)
%----------------------------------参数----------------------------------
%Close-收盘价序列
%Volume-成交量序列
%----------------------------------输出----------------------------------
%NVIValue-负成交量指标

NVIValue=zeros(length(Close),1);
for i=1:length(Close)
    if i==1
        NVIValue(i)=100;
    end
    if i>1
        if Volume(i)>=Volume(i-1)
            NVIValue(i)=NVIValue(i-1);            
        else
            NVIValue(i)=NVIValue(i-1)+(Close(i)-Close(i-1))/Close(i-1)*NVIValue(i-1);
        end
    end
end

end

