function RSIValue=RSI(Price,Length)
%--------------------此函数用来计算RSI(相对强弱指数)-----------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]姜金胜.指标精萃：经典技术指标精解与妙用.东华大学出版社,2004年01月第1版
%[2]招商证券.基于纯技术指标的多因子选股模型,2014-04-11
%[3]浙商证券.技术指标优化择时：10年30倍收益,2010-12-23
%[4]来自网络.24个基本指标精粹讲解
%----------------------------------简介----------------------------------
%相对强弱指标(Relative Strength Index)是与KDJ齐名的常用技术指标，它以一定时期
%内股价的变动情况推测价格未来的变动方向，并根据股价的涨跌幅显示市场的强弱。
%RSI指标是根据股票市场上供求关系平衡的原理，通过比较一段时期内单个股票价格的涨跌
%的幅度或整个市场的指数的涨跌的大小来分析判断市场上多空双方买卖力量的强弱程度，从
%而判断未来市场走势的一种技术分析指标。RSI指标是一定时期内市场的涨幅与涨幅加跌幅
%的比值。它是买卖力量在数量和图形上的体现，投资者可以根据其所反映的行情变动情况
%及轨迹来预测未来的价格走势。在实践中，人们通常将其与移动平均线配合使用，借以提
%高预测的准确性。
%----------------------------------基本用法------------------------------
%1)RSI在 50以上表示市场为多头市场，否则为空头市场.RSI 还可以分为 4 个区域，当
%市场处于极弱（RSI 小于20）或强势状态(RSI在50~80 之间)时，可介入。当市场处于
%极强(RSI大于 80)或弱势(RSI在 20~50之间)状态时卖出
%2)当短期RSI上穿长期RSI买入，当短期 RSI下穿长期RSI卖出 
%----------------------------------调用函数------------------------------
%RSIValue=RSI(Price,Length)
%----------------------------------参数----------------------------------
%Price-价格序列，常用收盘价
%Length-计算RSI指标所考虑的周期，常用14
%----------------------------------输出----------------------------------
%RSIValue-相对强弱指数

RSIValue=zeros(length(Price),1);
DiffofPrice=zeros(length(Price),1);
DiffofPrice(2:end)=Price(2:end)-Price(1:end-1);
RSIValue(1:Length)=50;
for i=Length+1:length(Price)
    Temp=DiffofPrice(i-Length+1:i);
    RSIValue(i)=sum(Temp(Temp>0))/sum(abs(Temp))*100;%注：查看文献可知，RSI有几种算法，这是其中一种
end
end



