function [TRIXValue,MATRIXValue]=TRIX(Price,Length,SmoothLength)
%--------------------此函数用来计算TRIX(三重指数平滑移动平均线)------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]姜金胜.指标精萃：经典技术指标精解与妙用.东华大学出版社,2004年01月第1版
%[2]招商证券.基于纯技术指标的多因子选股模型,2014-04-11
%[3]交易开拓者(TB).公式应用TRIX的算法
%----------------------------------简介----------------------------------
%指标又叫三重指数平滑移动平均指标，其英文全名为“Triple Exponentially 
%Smoothed Average”，是一种研究价格趋势的长期技术分析工具
%TRIX 指标是根据移动平均线理论，对一条平均线进行三次平滑处理，再根据这
%条移动平均线的变动情况来预测价格的长期走势。 
%与 TRMA 等趋向类指标一样，TRIX 指标一方面忽略价格短期波动的干扰，除去移
%动平均线频繁发出假信号的缺陷，避免由于交易行为过于频繁而造成较大交易成本
%的浪费，二则保留移动平均线的效果，凸现价格未来长期运动趋势，使投资者对
%未来较长时间内价格运动趋势有个直观、准确地了解。因此，对于稳健型的长期投
%资者来说，TRIX 指标对实战提供有益的参考。
%----------------------------------基本用法------------------------------
%TRIXValue和MATRIXValue形成金叉时买入，形成死叉时卖出
%更多用法，查看参考
%----------------------------------调用函数------------------------------
%[TRIXValue,MATRIXValue]=TRIX(Price,Length,SmoothLength)
%----------------------------------参数----------------------------------
%Price-价格序列，常用收盘价
%Length-计算TRIXValue时所考虑的长度
%SmoothLength-对TRIXValue进行平滑时考虑的长度
%----------------------------------输出----------------------------------
%TRIXValue-三重指数移动平均值
%MATRIXValue-TRIXValue的SmoothLength周期简单移动平均值

TRIXValue=zeros(length(Price),1);
MATRIXValue=zeros(length(Price),1);
TR=zeros(length(Price),1);
TR=EMA(EMA(EMA(Price,Length),Length),Length);
TRIXValue(2:end)=(TR(2:end)-TR(1:end-1))./TR(1:end-1)*100;
MATRIXValue=MA(TRIXValue,SmoothLength);
end

