function VHFValue=VHF(Price,Length)
%--------------------此函数用来计算VHF指标(十字过滤线)---------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]MBA智库百科.VHF词条
%[2]博客：http://blog.sina.com.cn/s/blog_43aac0970100w0y5.html
%[3]交易开拓者(TB).公式应用VHF算法
%----------------------------------简介----------------------------------
%十字过滤线(Vertical Horizontal Filter，VHF)，1991年8月于Futures杂志，
%由怀特(Adam White)首次发表，其主要的作用在于分辨行情的种类。趋势行情应
%该采用趋势指标，横向整理行情应该采用超买超卖指标，不同的指标适用于不同
%的市场走势。但是，如何区别目前的走势，属于单一方向的趋势行情？还是横向
%震荡的整理行情？是许多使用技术分析的股民，共同遭遇的难题。为了让技术分
%析的讯号，充分的发挥功能，不同的市况，必须搭配不同的指标。如果指标的选
%择错误，必然没办法得到好的操作结果。因此，辨别目前行情的地位，是每一位
%股民进行交易投资之前最重要的工作。怀特所设计的VHF指标，解决了上述的问
%题，提供股民清晰明确的讯号，可以澄清“趋势行情”与“箱型行情”的界限。
%经过VHF指标过滤后的行情，可以帮助股民选择最佳的指标组合。
%----------------------------------基本用法------------------------------
%1)VHF的值越高,代表目前正处于趋势行情,应选择趋势指标为参考工具
%2)VHF的值越低,代表目前正处于箱型行情,应选择超买超卖指标为参考工具
%3)VHF处于上升状态时,代表股价处于趋势行情
%4)VHF处于下跌状态时,代表股价处于箱型行情
%更多用法，请查看参考
%----------------------------------调用函数------------------------------
%VHFValue=VHF(Price,Length)
%----------------------------------参数----------------------------------
%Price-价格序列，常用收盘价
%Length-考虑的周期，常用5个Bar
%----------------------------------输出----------------------------------
%VHFValu-VHF指标

VHFValue=zeros(length(Price),1);
DiffofPrice=zeros(length(Price),1);
DiffofPrice(2:end)=Price(2:end)-Price(1:end-1);
DiffofPrice=abs(DiffofPrice);
VHFValue(1:Length-1)=0.5;
for i=Length:length(Price)
    
    sum(DiffofPrice(i-Length+1:i));
    VHFValue(i)=abs(max(Price(i-Length+1:i))-min(Price(i-Length+1:i)))/...
        sum(DiffofPrice(i-Length+1:i));
end
VHFValue(VHFValue==inf)=0.5;
end

