function WADValue=WAD(High,Low,Close)
%----------------------此函数用来计算WAD指标(威廉离散量)-------------------
%----------------------------------编写者--------------------------------
%Lian Xiangbin(连长,785674410@qq.com),DUFE,2014
%----------------------------------参考----------------------------------
%[1]百度百科.WAD词条
%[2]交易开拓者.公式应用WAD算法
%----------------------------------简介----------------------------------
%威廉多空力度线(WAD)的操作原则与OBV指标相同，但比OBV指标更有意义，能提
%前指出股价破位。
%----------------------------------基本用法------------------------------
%1)股价一顶比一顶高，而WAD一顶比一顶低，暗示头部即将形成
%  股价一底比一底低，而WAD一底比一底高，暗示底部即将形成
%2)WAD向上交叉MAWAD，为买进信号；WAD向下交叉MAWAD，为卖出信号
%----------------------------------调用函数------------------------------
%WADValue=WAD(High,Low,Close)
%----------------------------------参数----------------------------------
%High-最高价序列
%Low-最低价序列
%Close-收盘价序列
%----------------------------------输出----------------------------------
%WADValue-威廉离散量

WADValue=zeros(length(High),1);
TRH=zeros(length(High),1);
TRL=zeros(length(High),1);
AD=zeros(length(High),1);
for i=1:length(High)
    if i==1
        WADValue(i)=0;
    end
    if i>1
        TRH(i)=max(Close(i-1),High(i));
        TRL(i)=min(Close(i-1),Low(i));
        if Close(i)>Close(i-1)
            AD(i)=Close(i)-TRL(i);
        elseif Close(i)<Close(i-1)
            AD(i)=Close(i)-TRH(i);
        else AD(i)=0;
        end
        WADValue(i)=WADValue(i-1)+AD(i);
    end
end

end

